TestEDT/src/InformationRegisters/ПриглашенияКОбменуЭлектроннымиДокументами/ПриглашенияКОбменуЭлектроннымиДокументами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПриглашенияКОбменуЭлектроннымиДокументами</name>
  <resources>
    <name>ИдентификаторКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторОператора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИНН</name>
    <comment>Данные организации, владеющей идентификатором контрагента, указанном в приглашении. Являются достоверными только при статусах приглашения &quot;Принято&quot;, &quot;ТребуетсяСогласие&quot;. Используется для: 1) заполнения в служебных квитанциях (извещении о получении, уведомлении об уточнении, предложении об аннулировании), так как в них указываются данные транспортных участников обмена, а не логических (т.е. в документе может быть один контрагент, а получен он может быть от другого).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КПП</name>
    <comment>Данные организации, владеющей идентификатором контрагента, указанном в приглашении. Являются достоверными только при статусах приглашения &quot;Принято&quot;, &quot;ТребуетсяСогласие&quot;. Используется для: 1) заполнения в служебных квитанциях (извещении о получении, уведомлении об уточнении, предложении об аннулировании), так как в них указываются данные транспортных участников обмена, а не логических (т.е. в документе может быть один контрагент, а получен он может быть от другого).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПриглашений</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыПриглашений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Ссылка на контрагента информационной базы, соответствующего владельцу идентификатора контрагента, указанного в приглашении. Используется для: 1) заполнения его во входящем произвольном документе в случае, если данные контрагента не указаны в транспортной информации; 2) вывода и фильтрации в списке приглашений; 3) стартового создания настроек отправки/получения при переходе связи в состояние &quot;Принято&quot;.</comment>
    <type>
      <types>DefinedType.КонтрагентБЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <comment>Данные организации, владеющей идентификатором контрагента, указанном в приглашении. Являются достоверными только при статусах приглашения &quot;Принято&quot;, &quot;ТребуетсяСогласие&quot;. Используется для: 1) заполнения в служебных квитанциях (извещении о получении, уведомлении об уточнении, предложении об аннулировании), так как в них указываются данные транспортных участников обмена, а не логических (т.е. в документе может быть один контрагент, а получен он может быть от другого).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EmailКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EmailОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПриглашения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ознакомиться</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ключ</name>
    <comment>Для внутренних операций - &quot;КлючПриглашения&quot;, для взаимодействия с сервисом - &quot;ВнешнийКод&quot;, &quot;ExternalContactId&quot;. При отправке широковещательного приглашения не заполняется.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestEDT/src/InformationRegisters/ПриглашенияКОбменуЭлектроннымиДокументами/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтотОбъект.Количество() Тогда
		ПроверитьУникальностьПриглашений(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	КонтрагентыИзПриглашений = Новый Массив;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.Контрагент)
			И КонтрагентыИзПриглашений.Найти(Запись.Контрагент) = Неопределено Тогда
			
			КонтрагентыИзПриглашений.Добавить(Запись.Контрагент);
		КонецЕсли;
	КонецЦикла;

	Если КонтрагентыИзПриглашений.Количество() Тогда
		РаботаСАбонентамиЭДО.ОбновитьСостоянияКонтрагентов(КонтрагентыИзПриглашений);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьУникальностьПриглашений(Отказ)
	
	ПроверяемыеПриглашения = ЭтотОбъект.Выгрузить(, "Ключ,ИдентификаторОрганизации,ИдентификаторКонтрагента");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПроверяемыеПриглашения.Ключ КАК Ключ,
		|	ПроверяемыеПриглашения.ИдентификаторОрганизации КАК ИдентификаторОрганизации,
		|	ПроверяемыеПриглашения.ИдентификаторКонтрагента КАК ИдентификаторКонтрагента
		|ПОМЕСТИТЬ ВТ_ПроверяемыеПриглашения
		|ИЗ
		|	&ПроверяемыеПриглашения КАК ПроверяемыеПриглашения
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ключ,
		|	ИдентификаторОрганизации,
		|	ИдентификаторКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриглашенияНаИдентификаторы.Ключ КАК КлючСуществующего,
		|	ВТ_ПроверяемыеПриглашения.Ключ КАК КлючЗаписываемого,
		|	ПриглашенияНаИдентификаторы.ИдентификаторОрганизации,
		|	ПриглашенияНаИдентификаторы.ИдентификаторКонтрагента
		|ИЗ
		|	ВТ_ПроверяемыеПриглашения КАК ВТ_ПроверяемыеПриглашения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПриглашенияКОбменуЭлектроннымиДокументами КАК ПриглашенияНаИдентификаторы
		|		ПО ВТ_ПроверяемыеПриглашения.ИдентификаторОрганизации = ПриглашенияНаИдентификаторы.ИдентификаторОрганизации
		|		И ВТ_ПроверяемыеПриглашения.ИдентификаторКонтрагента = ПриглашенияНаИдентификаторы.ИдентификаторКонтрагента
		|ГДЕ
		|	ВТ_ПроверяемыеПриглашения.Ключ <> ПриглашенияНаИдентификаторы.Ключ
		|	И ВТ_ПроверяемыеПриглашения.ИдентификаторОрганизации <> """"
		|	И ВТ_ПроверяемыеПриглашения.ИдентификаторКонтрагента <> """"";
	
	Запрос.УстановитьПараметр("ПроверяемыеПриглашения", ПроверяемыеПриглашения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ШаблонТекстаОшибки = 
		НСтр("ru = 'Приглашение с идентификатором организации: %1 и идентификатором контрагента: %2 уже существует.
									|Ключ существующего приглашения: %3, ключ записываемого приглашения: %4'");
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки,
			ВыборкаДетальныеЗаписи.ИдентификаторОрганизации, ВыборкаДетальныеЗаписи.ИдентификаторКонтрагента,
			ВыборкаДетальныеЗаписи.КлючСуществующего, ВыборкаДетальныеЗаписи.КлючЗаписываемого);
	
		КлючПриглашения = ПриглашенияЭДОКлиентСервер.НовыйКлючПриглашения();
		КлючПриглашения.Ключ = ВыборкаДетальныеЗаписи.КлючСуществующего;
		КлючПриглашения.ИдентификаторОрганизации = ВыборкаДетальныеЗаписи.ИдентификаторОрганизации;
		КлючЗаписиПриглашения = ПриглашенияЭДО.КлючЗаписиПриглашения(КлючПриглашения);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, КлючЗаписиПриглашения);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
